app/views/users/_form.html.haml

SELECT "roles".* FROM "roles"
---
      = f.label :role
      = f.collection_select :role_id, Role.all, :id, :title
  .actions